nxp-mcuxpresso/mcux-soc-svd/MIMXRT533S/MIMXRT533S.xml
        <register>
          <name>PDSLEEPCFG2</name>
          <description>Sleep configuration 2</description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM_IF0_APD</name>
              <description>Array power for RAM interface 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF0_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF0_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF1_APD</name>
              <description>Array power for RAM interface 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF1_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF1_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF2_APD</name>
              <description>Array power for RAM interface 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF2_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF2_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF3_APD</name>
              <description>Array power for RAM interface 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF3_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF3_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF4_APD</name>
              <description>Array power for RAM interface 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF4_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF4_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF5_APD</name>
              <description>Array power for RAM interface 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF5_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF5_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF6_APD</name>
              <description>Array power for RAM interface 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF6_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF6_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF7_APD</name>
              <description>Array power for RAM interface 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF7_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF7_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF8_APD</name>
              <description>Array power for RAM interface 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF8_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF8_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF9_APD</name>
              <description>Array power for RAM interface 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF9_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF9_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF10_APD</name>
              <description>Array power for RAM interface 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF10_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF10_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF11_APD</name>
              <description>Array power for RAM interface 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF11_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF11_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF12_APD</name>
              <description>Array power for RAM interface 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF12_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF12_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF13_APD</name>
              <description>Array power for RAM interface 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF13_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF13_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF14_APD</name>
              <description>Array power for RAM interface 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF14_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF14_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF15_APD</name>
              <description>Array power for RAM interface 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF15_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF15_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF16_APD</name>
              <description>Array power for RAM interface 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF16_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF16_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF17_APD</name>
              <description>Array power for RAM interface 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF17_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF17_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF18_APD</name>
              <description>Array power for RAM interface 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF18_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF18_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF19_APD</name>
              <description>Array power for RAM interface 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF19_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF19_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF20_APD</name>
              <description>Array power for RAM interface 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF20_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF20_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF21_APD</name>
              <description>Array power for RAM interface 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF21_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF21_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF22_APD</name>
              <description>Array power for RAM interface 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF22_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF22_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF23_APD</name>
              <description>Array power for RAM interface 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF23_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF23_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF24_APD</name>
              <description>Array power for RAM interface 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF24_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF24_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF25_APD</name>
              <description>Array power for RAM interface 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF25_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF25_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF26_APD</name>
              <description>Array power for RAM interface 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF26_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF26_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF27_APD</name>
              <description>Array power for RAM interface 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF27_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF27_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF28_APD</name>
              <description>Array power for RAM interface 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF28_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
