nxp-mcuxpresso/mcux-soc-svd/MIMXRT533S/MIMXRT533S.xml
        <register>
          <name>STARTEN2_CLR</name>
          <description>Start Enable 2</description>
          <addressOffset>0x6C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>FLEXCOMM12</name>
              <description>FlexComm 12 interrupt wake-up</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Clears the STARTEN2 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM13</name>
              <description>FlexComm 13 interrupt wake-up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Clears the STARTEN2 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM16</name>
              <description>FlexComm 16 interrupt wake-up</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Clears the STARTEN2 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FROSAFETY</name>
          <description>FRO Safety</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>FROSAFETY</name>
              <description>FRO Safety</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINCLKSAFETY</name>
          <description>Main Clock Safety</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY</name>
              <description>Main Clock turn on delay for Deep Sleep wake up</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWWAKE</name>
          <description>Hardware Wake</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORCEWAKE</name>
              <description>Force peripheral clocking to stay on during deep-sleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCWAKE</name>
              <description>Wake for FlexComm Interfaces.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMICWAKE</name>
              <description>Wake for Digital Microphone.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAC0WAKE</name>
              <description>Wake for DMAC0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAC1WAKE</name>
              <description>Wake for DMAC1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSORCTL</name>
          <description>Temperature Sensor Control</description>
          <addressOffset>0xE0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSSRC</name>
              <description>Temperature Sensor Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC Built-in Temperature Sensor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>PMC Temperature Sensor</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTSTATELOCK</name>
          <description>Boot State Lock</description>
          <addressOffset>0xE40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTSTATESEEDLOCK</name>
              <description>Boot State Seed Lockout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOTSTATESEEDLOCK_0</name>
                  <description>BOOTSTATESEED[0:7] can be changed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTSTATESEEDLOCK_1</name>
                  <description>BOOTSTATESEED[0:7] cannot be changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTSTATEHMACLOCK</name>
              <description>Boot State HMA Lockout</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOTSTATEHMACLOCK_0</name>
                  <description>BOOTSTATEHMAC[0:7] can be changed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTSTATEHMACLOCK_1</name>
                  <description>BOOTSTATEHMAC[0:7] cannot be changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BOOTSTATESEED[%s]</name>
          <description>Boot State Seed</description>
          <addressOffset>0xE50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTSTATESEED</name>
              <description>BOOTSTATESEED[0:7]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BOOTSTATEHMAC[%s]</name>
          <description>HMAC of boot state used for attestation.</description>
          <addressOffset>0xE70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTSTATEHMAC</name>
              <description>BOOTSTATEHMAC[0:7]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI0PADCTL</name>
          <description>FLEXSPI0 Pad Control</description>
          <addressOffset>0xEF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A50000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RASRCN_3_0</name>
              <description>Drives FLEXSPI0 Pad Compensation Circuit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RASRCP_3_0</name>
              <description>Drives FLEXSPI0 Pad Compensation Circuit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTFRZ</name>
              <description>Drives FLEXSPI0 Pad Compensation Circuit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREEZE</name>
              <description>Drives FLEXSPI0 Pad Compensation Circuit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPTQ</name>
              <description>Drives FLEXSPI0 Pad Compensation Circuit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPEN</name>
              <description>Drives FLEXSPI0 Pad Compensation Circuit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NASRCN</name>
              <description>FLEXSPI0 Pad Compensation Circuit Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NASRCP</name>
              <description>FLEXSPI0 Pad Compensation Circuit Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPOK</name>
              <description>FLEXSPI0 Pad Compensation Circuit Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1PADCTL</name>
          <description>FLEXSPI1 Pad Control</description>
          <addressOffset>0xEF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A50000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RASRCN_3_0</name>
              <description>Drives FLEXSPI1 Pad Compensation Circuit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RASRCP_3_0</name>
              <description>Drives FLEXSPI1 Pad Compensation Circuit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTFRZ</name>
              <description>Drives FLEXSPI1 Pad Compensation Circuit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREEZE</name>
              <description>Drives FLEXSPI1 Pad Compensation Circuit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPTQ</name>
              <description>Drives FLEXSPI1 Pad Compensation Circuit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPEN</name>
              <description>Drives FLEXSPI1 Pad Compensation Circuit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NASRCN_3_0</name>
              <description>FLEXSPI1 Pad Compensation Circuit Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NASRCP_3_0</name>
              <description>FLEXSPI1 Pad Compensation Circuit Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPOK</name>
              <description>FLEXSPI1 Pad Compensation Circuit Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO0PADCTL</name>
          <description>SDIO0 Pad Control</description>
          <addressOffset>0xEF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A50000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RASRCN</name>
              <description>Drives SDIO0 Pad Compensation Circuit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RASRCP</name>
              <description>Drives SDIO0 Pad Compensation Circuit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTFRZ</name>
              <description>Drives SDIO0 Pad Compensation Circuit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREEZE</name>
              <description>Drives SDIO0 Pad Compensation Circuit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPTQ</name>
              <description>Drives SDIO0 Pad Compensation Circuit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPEN</name>
              <description>Drives SDIO0 Pad Compensation Circuit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NASRCN</name>
              <description>SDIO0 Pad Compensation Circuit Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NASRCP</name>
              <description>SDIO0 Pad Compensation Circuit Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPOK</name>
              <description>SDIO0 Pad Compensation Circuit Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO1PADCTL</name>
          <description>SDIO1 Pad Control</description>
          <addressOffset>0xEFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A50000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RASRCN</name>
              <description>Drives SDIO1 Pad Compensation Circuit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RASRCP</name>
              <description>Drives SDIO1 Pad Compensation Circuit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTFRZ</name>
              <description>Drives SDIO1 Pad Compensation Circuit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREEZE</name>
              <description>Drives SDIO1 Pad Compensation Circuit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPTQ</name>
              <description>Drives SDIO1 Pad Compensation Circuit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPEN</name>
              <description>Drives SDIO1 Pad Compensation Circuit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NASRCN</name>
              <description>SDIO1 Pad Compensation Circuit Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NASRCP</name>
              <description>SDIO1 Pad Compensation Circuit Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPOK</name>
              <description>SDIO1 Pad Compensation Circuit Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DICEHWREGn</name>
          <description>Compound Device Identifier (CDI)</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DICEHWREGN</name>
              <description>DICE General Purpose 32-Bit Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>UUID[%s]</name>
          <description>UUID</description>
          <addressOffset>0xF50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UUIDN</name>
              <description>UUIDn 32-Bit Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
