nxp-mcuxpresso/mcux-soc-svd/MIMXRT533S/MIMXRT533S.xml
        <register>
          <name>DMAC1_CHMUX_SEL6</name>
          <description>DMAC1 Channel mux select 6</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH6_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM13_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL7</name>
          <description>DMAC1 Channel mux select 7</description>
          <addressOffset>0x53C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH7_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM13_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL8</name>
          <description>DMAC1 Channel mux select 8</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>FLEXCOM16_RX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL9</name>
          <description>DMAC1 Channel mux select 9</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>FLEXCOM16_TX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL10</name>
          <description>DMAC1 Channel mux select 10</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>I3C1_RX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL11</name>
          <description>DMAC1 Channel mux select 11</description>
          <addressOffset>0x54C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>I3C1_TX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL12</name>
          <description>DMAC1 Channel mux select 12</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM11_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL13</name>
          <description>DMAC1 Channel mux select 13</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM11_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL14</name>
          <description>DMAC1 Channel mux select 14</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMA channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM12_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL15</name>
          <description>DMAC1 Channel mux select 15</description>
          <addressOffset>0x55C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM12_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CT32BIT0_CAP0_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CT32BIT0_CAP1_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
