nxp-mcuxpresso/mcux-soc-svd/MIMXRT533S/MIMXRT533S.xml
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTCTL[%s]</name>
          <description>Shifter Control N Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMOD</name>
              <description>Shifter Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>receive</name>
                  <description>Receive mode. Captures the current Shifter content into the SHIFTBUF on expiration of the Timer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>transmit</name>
                  <description>Transmit mode. Load SHIFTBUF contents into the Shifter on expiration of the Timer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>matchstore</name>
                  <description>Match Store mode. Shifter data is compared to SHIFTBUF content on expiration of the Timer.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>matchcont</name>
                  <description>Match Continuous mode. Shifter data is continuously compared to SHIFTBUF contents.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>state</name>
                  <description>State mode. SHIFTBUF contents are used for storing programmable state attributes.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>logic</name>
                  <description>Logic mode. SHIFTBUF contents are used for implementing programmable logic look up table.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOL</name>
              <description>Shifter Pin Polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active_high</name>
                  <description>Pin is active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>active_low</name>
                  <description>Pin is active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Shifter Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINCFG</name>
              <description>Shifter Pin Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Shifter pin output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>opend_bidirouten</name>
                  <description>Shifter pin open drain or bidirectional output enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bidir_outdata</name>
                  <description>Shifter pin bidirectional output data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>output</name>
                  <description>Shifter pin output</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPOL</name>
              <description>Timer Polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>posedge</name>
                  <description>Shift on posedge of Shift clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>negedge</name>
                  <description>Shift on negedge of Shift clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMSEL</name>
              <description>Timer Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTCFG[%s]</name>
          <description>Shifter Configuration N Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSTART</name>
              <description>Shifter Start bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value00</name>
                  <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value01</name>
                  <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on first shift</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value10</name>
                  <description>Transmitter outputs start bit value 0 before loading data on first shift, receiver/match store sets error flag if start bit is not 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value11</name>
                  <description>Transmitter outputs start bit value 1 before loading data on first shift, receiver/match store sets error flag if start bit is not 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSTOP</name>
              <description>Shifter Stop bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value00</name>
                  <description>Stop bit disabled for transmitter/receiver/match store</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value01</name>
                  <description>Stop bit disabled for transmitter/receiver/match store, receiver/match store will store receive data on the configured shift edge when timer in stop condition</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value10</name>
                  <description>Transmitter outputs stop bit value 0 on store, receiver/match store sets error flag if stop bit is not 0, receiver/match store will also store receive data on the configured shift edge when timer in stop condition</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value11</name>
                  <description>Transmitter outputs stop bit value 1 on store, receiver/match store sets error flag if stop bit is not 1, receiver/match store will also store receive data on the configured shift edge when timer in stop condition</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSRC</name>
              <description>Input Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pin</name>
                  <description>Pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shifter_nplus1</name>
                  <description>Shifter N+1 Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATST</name>
              <description>Late Store</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>preshift</name>
                  <description>Shift register stores the pre-shift register state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>postshift</name>
                  <description>Shift register stores the post-shift register state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSIZE</name>
              <description>Shifter Size</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>width32</name>
                  <description>Shift register is 32-bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>width24</name>
                  <description>Shift register is 24-bit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWIDTH</name>
              <description>Parallel Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUF[%s]</name>
          <description>Shifter Buffer N Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUF</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFBIS[%s]</name>
          <description>Shifter Buffer N Bit Swapped Register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFBYS[%s]</name>
          <description>Shifter Buffer N Byte Swapped Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBYS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFBBS[%s]</name>
          <description>Shifter Buffer N Bit Byte Swapped Register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCTL[%s]</name>
          <description>Timer Control N Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMOD</name>
              <description>Timer Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Timer Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_baud</name>
                  <description>Dual 8-bit counters baud mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_pwm_h</name>
                  <description>Dual 8-bit counters PWM high mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>single16bit</name>
                  <description>Single 16-bit counter mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>single16bit_disable</name>
                  <description>Single 16-bit counter disable mode.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_word</name>
                  <description>Dual 8-bit counters word mode.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_pwm_l</name>
                  <description>Dual 8-bit counters PWM low mode.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>single16bit_in_capture</name>
                  <description>Single 16-bit input capture mode.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONETIM</name>
              <description>Timer One Time Operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_blocked</name>
                  <description>The timer enable event is generated as normal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>blocked</name>
                  <description>The timer enable event is blocked unless timer status flag is clear.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PININS</name>
              <description>Timer Pin Input Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pinsel</name>
                  <description>Timer pin input and output are selected by PINSEL.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pinselplus1</name>
                  <description>Timer pin input is selected by PINSEL+1, timer pin output remains selected by PINSEL.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOL</name>
              <description>Timer Pin Polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active_high</name>
                  <description>Pin is active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>active_low</name>
                  <description>Pin is active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Timer Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINCFG</name>
              <description>Timer Pin Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>outdisable</name>
                  <description>Timer pin output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>opend_bidirouten</name>
                  <description>Timer pin open drain or bidirectional output enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bidir_outdata</name>
                  <description>Timer pin bidirectional output data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>output</name>
                  <description>Timer pin output</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Trigger Source</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ext_trig</name>
                  <description>External trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>internal_trig</name>
                  <description>Internal trigger selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGPOL</name>
              <description>Trigger Polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active_high</name>
                  <description>Trigger active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>active_low</name>
                  <description>Trigger active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
