nxp-mcuxpresso/mcux-soc-svd/MIMXRT533S/MIMXRT533S.xml
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ALIAS[%s]</name>
          <description>Alias</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DIGEST0[%s]</name>
          <description>Digest0 n/Output Data0 n</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIGEST</name>
              <description>Digest</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTCFG</name>
          <description>Cryptographic Configuration</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSW1ST_OUT</name>
              <description>Most Significant Word 1st Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPKEY</name>
              <description>Swap Key</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPDAT</name>
              <description>Swap Data/IV Inputs</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSW1ST</name>
              <description>Most Significant Word 1st Load</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESMODE</name>
              <description>AES Cipher Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>ECB - used as is</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>CBC mode (see details on IV/nonce)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>CTR mode (see details on IV/nonce). See also AESCTRPOS.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESDECRYPT</name>
              <description>AES Decrypt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Encrypt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECRYPT</name>
                  <description>Decrypt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESSECRET</name>
              <description>AES Secret</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_WAY</name>
                  <description>User key provided in normal way</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIDDEN_WAY</name>
                  <description>Secret key provided in hidden way by HW</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKEYSZ</name>
              <description>AES Key Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BITS_128</name>
                  <description>128 bit key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_192</name>
                  <description>192 bit key</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_256</name>
                  <description>256 bit key</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESCTRPOS</name>
              <description>AES CTR Position</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STREAMLAST</name>
              <description>Stream Last</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICBSZ</name>
              <description>ICB Size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BITS_32</name>
                  <description>32 bits of the IV/ctr are used (from 127:96)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_64</name>
                  <description>64 bits of the IV/ctr are used (from 127:64)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_96</name>
                  <description>96 bits of the IV/ctr are used (from 127:32)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT_128</name>
                  <description>All 128 bits of the IV/ctr are used</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICBSTRM</name>
              <description>ICB Stream Size</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKS_8</name>
                  <description>8 blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_16</name>
                  <description>16 blocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_32</name>
                  <description>32 blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_64</name>
                  <description>64 blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x9CB</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUAL</name>
              <description>Reads 1 if 2 x 512 bit buffers, 0 if only 1 x 512 bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA</name>
              <description>Reads 1 if DMA is connected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB</name>
              <description>Reads 1 if AHB Master is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AES</name>
              <description>Reads 1 if AES 128 is included</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AESKEY</name>
              <description>Reads 1 if AES 192 and 256 also included</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECRET</name>
              <description>Reads 1 if AES Secret key is available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICB</name>
              <description>ICB</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Lock</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECLOCK</name>
              <description>Secure Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Unlocks, so block is open to all. But, AHB Master will only issue non-secure requests.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Locks to the current security level. AHB Master will issue requests at this level.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATTERN</name>
              <description>Must write 0xA75 to change lock state. A75:Pattern needed to change bits 1:0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MASK[%s]</name>
          <description>Mask</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MASK</name>
              <description>A random word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RELOAD[%s]</name>
          <description>DIGEST/OUTDATA Reload</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIGEST</name>
              <description>SHA Digest word to reload.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRNG_SEED</name>
          <description>PRNG Seed</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRNG_SEED</name>
              <description>SHA Digest word to reload.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRNG_OUT</name>
          <description>PRNG Output</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRNG_OUT_R</name>
              <description>SHA Digest word to reload.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
